In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data_cleaning_sample.csv")

In [3]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [4]:
df.isnull()

    Name    Age   City  Gender  Email  Join Date
0  False  False  False   False  False      False
1  False   True  False   False  False      False
2  False  False  False   False  False      False
3  False   True  False   False  False      False
4  False  False  False   False  False      False
5   True  False  False   False  False       True
6  False  False  False   False  False      False
7  False  False  False   False  False      False
8  False   True  False   False  False      False

In [5]:
df.isnull().sum()

Name         1
Age          3
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [6]:
df.dropna()

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12-11-2019
6  Alice  25.0     New York      F  alice@example.com  01-05-2021
7  Alice  25.0     New York      F  alice@example.com  01-05-2021

In [7]:
df.dropna(axis=1)

          City Gender              Email
0     New York      F  alice@example.com
1        Delhi      M    charlie@example
2  Los Angeles      M    bob@example.com
3        Delhi      M    charlie@example
4       Mumbai      M  david@example.com
5        Delhi      F     eve@domain.com
6     New York      F  alice@example.com
7     New York      F  alice@example.com
8        Delhi      M    charlie@example

In [14]:
df.dropna(axis=0)

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12-11-2019
6  Alice  25.0     New York      F  alice@example.com  01-05-2021
7  Alice  25.0     New York      F  alice@example.com  01-05-2021

In [8]:
df.fillna(0)

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5        0  28.0        Delhi      F     eve@domain.com           0
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   0.0        Delhi      M    charlie@example  20-07-2021

In [10]:
df.fillna(method = "ffill")

C:\Users\Rutuja Shelke\AppData\Local\Temp\ipykernel_692\1983593268.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill")

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5    David  28.0        Delhi      F     eve@domain.com  12-11-2019
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie  25.0        Delhi      M    charlie@example  20-07-2021

In [11]:
df.ffill()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5    David  28.0        Delhi      F     eve@domain.com  12-11-2019
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie  25.0        Delhi      M    charlie@example  20-07-2021

In [12]:
df.bfill()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  22.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5    Alice  28.0        Delhi      F     eve@domain.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [13]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [15]:
df.drop_duplicates()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [19]:
df.duplicated(subset=["Name", "Age"])

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [20]:
df["Name"].str.lower()

0      alice
1    charlie
2        bob
3    charlie
4      david
5        NaN
6      alice
7      alice
8    charlie
Name: Name, dtype: object

In [27]:
df["City"].str.contains("mumbai", case = False)

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
Name: City, dtype: bool

In [28]:
df["Email"].str.split("@")

0    [alice, example.com]
1      [charlie, example]
2      [bob, example.com]
3      [charlie, example]
4    [david, example.com]
5       [eve, domain.com]
6    [alice, example.com]
7    [alice, example.com]
8      [charlie, example]
Name: Email, dtype: object

In [46]:
df.dropna().copy

<bound method NDFrame.copy of     Name   Age         City Gender              Email   Join Date Age Group
0  Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020     Adult
4  David  22.0       Mumbai      M  david@example.com  12-11-2019     Adult
6  Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
7  Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult>

In [54]:
df

,Name,Age,City,Gender,Email,Join Date,Age Group,Age group
0,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
1,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...
2,Bob,30.0,Los Angeles,M,bob@example.com,15-06-2020,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
3,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...
4,David,22.0,Mumbai,M,david@example.com,12-11-2019,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
5,NaN,28.0,Delhi,F,eve@domain.com,NaN,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
6,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
7,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
8,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...

In [55]:
def agegroup(x):
    return lambda x: "Adult" if x > 18 else "Minor"

df["Age group"] = df["Age"].apply(agegroup)

In [56]:
df

,Name,Age,City,Gender,Email,Join Date,Age Group,Age group
0,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
1,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...
2,Bob,30.0,Los Angeles,M,bob@example.com,15-06-2020,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
3,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...
4,David,22.0,Mumbai,M,david@example.com,12-11-2019,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
5,NaN,28.0,Delhi,F,eve@domain.com,NaN,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
6,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
7,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
8,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...

In [57]:
df["Age Group"] = df["Age"].apply(lambda x: "Adult" if x > 18 else "Minor")

In [58]:
df

,Name,Age,City,Gender,Email,Join Date,Age Group,Age group
0,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
1,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...
2,Bob,30.0,Los Angeles,M,bob@example.com,15-06-2020,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
3,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...
4,David,22.0,Mumbai,M,david@example.com,12-11-2019,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
5,NaN,28.0,Delhi,F,eve@domain.com,NaN,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
6,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
7,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
8,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...

In [60]:
df.dropna(subset=["Age group"])

,Name,Age,City,Gender,Email,Join Date,Age Group,Age group
0,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
1,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...
2,Bob,30.0,Los Angeles,M,bob@example.com,15-06-2020,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
3,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...
4,David,22.0,Mumbai,M,david@example.com,12-11-2019,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
5,NaN,28.0,Delhi,F,eve@domain.com,NaN,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
6,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
7,Alice,25.0,New York,F,alice@example.com,01-05-2021,Adult,<function agegroup.<locals>.<lambda> at 0x0000...
8,Charlie,NaN,Delhi,M,charlie@example,20-07-2021,Minor,<function agegroup.<locals>.<lambda> at 0x0000...

In [64]:
df = df.drop(columns=["Age group"])

In [65]:
df

      Name   Age         City Gender              Email   Join Date Age Group
0    Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020     Adult
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor
4    David  22.0       Mumbai      M  david@example.com  12-11-2019     Adult
5      NaN  28.0        Delhi      F     eve@domain.com         NaN     Adult
6    Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
7    Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor

In [67]:
gender_map = { "F" : "Female" , "M" : "Male" , "O" : "Other" }
df["Gender"] = df["Gender"].map(gender_map)

In [68]:
df

      Name   Age         City  Gender              Email   Join Date Age Group
0    Alice  25.0     New York  Female  alice@example.com  01-05-2021     Adult
1  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021     Minor
2      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020     Adult
3  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021     Minor
4    David  22.0       Mumbai    Male  david@example.com  12-11-2019     Adult
5      NaN  28.0        Delhi  Female     eve@domain.com         NaN     Adult
6    Alice  25.0     New York  Female  alice@example.com  01-05-2021     Adult
7    Alice  25.0     New York  Female  alice@example.com  01-05-2021     Adult
8  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021     Minor

In [69]:
df["City"] = df["City"].replace({"Delhi" : "New Delhi" , "Mumbai" : "New Mumbai"})

In [70]:
df

      Name   Age         City  Gender              Email   Join Date Age Group
0    Alice  25.0     New York  Female  alice@example.com  01-05-2021     Adult
1  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
2      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020     Adult
3  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
4    David  22.0   New Mumbai    Male  david@example.com  12-11-2019     Adult
5      NaN  28.0    New Delhi  Female     eve@domain.com         NaN     Adult
6    Alice  25.0     New York  Female  alice@example.com  01-05-2021     Adult
7    Alice  25.0     New York  Female  alice@example.com  01-05-2021     Adult
8  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor